backend/app/Controllers/AccomplishmentReportController.php

    public function index()
    {
        $db = \Config\Database::connect();

        $reports = $db->table('accomplishment_report as ar')
            ->select('ar.id, ar.user_id, ar.act_design_id, ar.control_number as control, ar.activity_title as title, ar.start_date as date, ar.status, u.username as office, u.username as username, u.email, ad.form_type as formLabel')
            ->join('users u', 'u.id = ar.user_id', 'left')
            ->join('activity_design ad', 'ad.act_design_id = ar.act_design_id', 'left')
            ->whereNotIn('ar.status', ['Completed', 'Verified'])
            ->where('ar.deleted_at', null)
            ->orderBy('ar.created_at', 'DESC')
            ->get()->getResultArray();

        // Fallback for form_type if activity_design is archived
        foreach ($reports as &$r) {
            if (empty($r['formLabel']) && !empty($r['act_design_id'])) {
                $archivedDesign = $db->table('archived_activity_designs')
                    ->where('original_act_design_id', $r['act_design_id'])
                    ->get()->getRowArray();
---
SELECT `aad`.*, `users`.`username` as `office`, `users`.`full_name` as `submitter_name`, `venues`.`venue_name` as `venue`
FROM `archived_activity_designs` as `aad`
LEFT JOIN `users` ON `users`.`id` = `aad`.`user_id`
LEFT JOIN `venues` ON `venues`.`venue_id` = `aad`.`venue_id`
LEFT JOIN `control_number` as `cn` ON `cn`.`act_design_id` = `aad`.`original_act_design_id`
WHERE `cn`.`control_number` = '2026-1876'