backend/app/Controllers/ArchiveController.php

    public function index()
    {
        $db = \Config\Database::connect();
        $payload = $this->request->jwtPayload ?? null;
        $userRole = $payload['role'] ?? ($this->request->getGet('role') ?? '');
        $userId = $payload['sub'] ?? ($payload['id'] ?? $this->request->getGet('user_id'));
        $isStaffOrAdmin = in_array($userRole, ['admin', 'gad_staff', 'staff', 'superadmin'], true);

        $designsQuery = $db->table('activity_design as aad')
            ->select('aad.*, aad.act_design_id as original_id, \'design\' as type, aad.activity_title as title, aad.form_type as form_label, users.username as office, aad.start_date as date, COALESCE(aad.archived_at, aad.end_date) as dateRaw')
            ->join('users', 'users.id = aad.user_id', 'left')
            ->select('COALESCE(aad.control_number, \'N/A\') as control')
            ->where('aad.is_archived', 1)
            ->where('aad.deleted_at IS NULL', null, false);

        $reportsQuery = $db->table('accomplishment_report as aar')
            ->select('aar.*, aar.id as original_id, \'report\' as type, aar.activity_title as title, \'N/A\' as form_label, users.username as office, aar.start_date as date, aar.control_number as control, COALESCE(aar.archived_at, aar.start_date) as dateRaw')
            ->join('users', 'users.id = aar.user_id', 'left')
            ->where('aar.is_archived', 1)
            ->where('aar.deleted_at IS NULL', null, false);

        if (!$isStaffOrAdmin) {
            $designsQuery->where('aad.user_id', $userId);
            $reportsQuery->where('aar.user_id', $userId);
        }

        $designs = $designsQuery->get()->getResultArray();
        $reports = $reportsQuery->get()->getResultArray();
---
SELECT `aad`.*, `aad`.`original_act_design_id` as `original_id`, "design" as `type`, `aad`.`activity_title` as `title`, `aad`.`form_type` as `form_label`, `users`.`username` as `office`, `aad`.`start_date` as `date`, `aad`.`archived_at` as `dateRaw`, COALESCE(cn.control_number, "N/A") as control
FROM `archived_activity_designs` as `aad`
LEFT JOIN `users` ON `users`.`id` = `aad`.`user_id`
LEFT JOIN `control_number` as `cn` ON `cn`.`act_design_id` = `aad`.`original_act_design_id`
WHERE `aad`.`user_id` = '2'
SELECT `aar`.*, `aar`.`original_report_id` as `original_id`, "report" as `type`, `aar`.`activity_title` as `title`, "N/A" as `form_label`, `users`.`username` as `office`, `aar`.`start_date` as `date`, `aar`.`control_number` as `control`, `aar`.`archived_at` as `dateRaw`
FROM `archived_accomplishment_reports` as `aar`
LEFT JOIN `users` ON `users`.`id` = `aar`.`user_id`
WHERE `aar`.`user_id` = '2'