backend/app/Controllers/AuthController.php

SELECT *
FROM `user_profiles`
WHERE `user_id` = '47'
---
        // Fetch profile and office information
        $db = \Config\Database::connect();
        $profile = $db->tableExists('user_profiles')
            ? ($db->table('user_profiles')->where('user_id', $user['id'])->get()->getRowArray() ?: [])